In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
!ls ../homework

AMZN.csv           apply_demo.csv     iris.csv           top5.csv
BABA.csv           city_weather.csv   movie_metadata.csv train.csv
Pokemon.csv        demo_duplicate.csv sales-funnel.xlsx  usa_flights.csv

In [3]:
df = pd.read_csv('../homework/demo_duplicate.csv')

In [4]:
del df['Unnamed: 0']

In [5]:
df.size

15956

In [6]:
len(df)

3989

In [7]:
len(df['Seqno'].unique())

1000

In [8]:
df.head(10)

   Price  Seqno Symbol        time
0   1623      0   APPL  1473411962
1   1623      0   APPL  1473411962
2   1623      0   APPL  1473411963
3   1623      0   APPL  1473411963
4   1649      1   APPL  1473411963
5   1649      1   APPL  1473411963
6   1649      1   APPL  1473411964
7   1649      1   APPL  1473411964
8   1642      2   APPL  1473411964
9   1642      2   APPL  1473411964

In [9]:
df['Seqno'].duplicated()
# 判断是否是duplicated

0       False
1        True
2        True
3        True
4       False
        ...
3984     True
3985    False
3986     True
3987     True
3988     True
Name: Seqno, Length: 3989, dtype: bool

In [14]:
df_uniq = df.drop_duplicates(['Seqno'],keep='last')
# keep：有重复只保留最后一个
df_uniq

      Price  Seqno Symbol        time
3      1623      0   APPL  1473411963
7      1649      1   APPL  1473411964
11     1642      2   APPL  1473411965
15     1636      3   APPL  1473411966
19     1669      4   APPL  1473411967
...     ...    ...    ...         ...
3972   1641    995   APPL  1473412958
3976   1581    996   APPL  1473412959
3980   1674    997   APPL  1473412960
3984   1680    998   APPL  1473412961
3988   1509    999   APPL  1473412962

[1000 rows x 4 columns]

In [11]:
df.head()

   Price  Seqno Symbol        time
0   1623      0   APPL  1473411962
1   1623      0   APPL  1473411962
2   1623      0   APPL  1473411963
3   1623      0   APPL  1473411963
4   1649      1   APPL  1473411963